Revit 2027 API
BuiltInFailures.SketchFailures.RailingDoublyConnectedError Property
 Railings hosted on Stairs must form a single, open, connected line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailingDoublyConnectedError { get; }
Public Shared ReadOnly Property RailingDoublyConnectedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailingDoublyConnectedError {
	FailureDefinitionId^ get ();
}
static member RailingDoublyConnectedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace